The beam join being modified contains beam that are not visible. Geometry of visible beams may be affected by hidden beams.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId HiddenBeamsEditingWarning { get; }
  Visual Basic
Public Shared ReadOnly Property HiddenBeamsEditingWarning As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ HiddenBeamsEditingWarning {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace